In [1]:
import numpy as np 
import pandas as pd

ModuleNotFoundError: No module named 'numpy'

In [56]:
s=pd.Series([1,3,5,np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [57]:
dates= pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [58]:
#Creating a DataFrame by passing a NumPy array, with a datetime index using date_range() and labeled columns
df= pd.DataFrame(np.random.randn(6,4), index= dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.959637  0.324907  0.341180  0.854882
2013-01-02  0.988419  1.377571  1.391394 -0.145714
2013-01-03 -1.194773  0.877041  0.199149 -0.914889
2013-01-04  0.424474  1.672649 -0.255267  0.219800
2013-01-05  0.185625 -0.926216  0.187528  0.789062
2013-01-06  0.463726 -0.375995 -1.631124 -0.529731

In [59]:
df2 = pd.DataFrame(

    {

        "A": 1.0,

        "B": pd.Timestamp("20130102"),

        "C": pd.Series(1, index=list(range(4)), dtype="float32"),

        "D": np.array([3] * 4, dtype="int32"),

        "E": pd.Categorical(["test", "train", "test", "train"]),

        "F": "foo",

    }

)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [60]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [61]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [62]:
#transpose
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.959637    0.988419   -1.194773    0.424474    0.185625    0.463726
B    0.324907    1.377571    0.877041    1.672649   -0.926216   -0.375995
C    0.341180    1.391394    0.199149   -0.255267    0.187528   -1.631124
D    0.854882   -0.145714   -0.914889    0.219800    0.789062   -0.529731

In [63]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05  0.185625 -0.926216  0.187528  0.789062
2013-01-06  0.463726 -0.375995 -1.631124 -0.529731
2013-01-01  0.959637  0.324907  0.341180  0.854882
2013-01-03 -1.194773  0.877041  0.199149 -0.914889
2013-01-02  0.988419  1.377571  1.391394 -0.145714
2013-01-04  0.424474  1.672649 -0.255267  0.219800

In [64]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.854882  0.341180  0.324907  0.959637
2013-01-02 -0.145714  1.391394  1.377571  0.988419
2013-01-03 -0.914889  0.199149  0.877041 -1.194773
2013-01-04  0.219800 -0.255267  1.672649  0.424474
2013-01-05  0.789062  0.187528 -0.926216  0.185625
2013-01-06 -0.529731 -1.631124 -0.375995  0.463726

In [19]:
df.A #single column

2013-01-01   -1.416497
2013-01-02    1.417273
2013-01-03   -1.076864
2013-01-04    0.885904
2013-01-05    1.133656
2013-01-06    1.063304
Freq: D, Name: A, dtype: float64

In [34]:
#selection by label(value in cell)
df.loc[dates[0]]

A   -1.416497
B   -0.364349
C    0.270176
D   -1.598880
Name: 2013-01-01 00:00:00, dtype: float64

In [35]:
df

                   A         B         C         D
2013-01-01 -1.416497 -0.364349  0.270176 -1.598880
2013-01-02  1.417273  1.801609  0.307748  1.341398
2013-01-03 -1.076864  0.775885  1.107011  0.750487
2013-01-04  0.885904 -0.652272 -0.116277 -1.303472
2013-01-05  1.133656  0.336882 -0.533011 -1.269728
2013-01-06  1.063304  1.038297 -0.864064  0.428878

In [36]:
df.iloc[0:3, 2]

2013-01-01    0.270176
2013-01-02    0.307748
2013-01-03    1.107011
Freq: D, Name: C, dtype: float64

In [37]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.416497 -0.364349
2013-01-02  1.417273  1.801609
2013-01-03 -1.076864  0.775885
2013-01-04  0.885904 -0.652272
2013-01-05  1.133656  0.336882
2013-01-06  1.063304  1.038297

In [38]:
df.at[dates[0], "A"]

-1.4164974086509723

In [40]:
#location by indexing 
df.iloc[1:3]

                   A         B         C         D
2013-01-02  1.417273  1.801609  0.307748  1.341398
2013-01-03 -1.076864  0.775885  1.107011  0.750487

In [41]:
df.iat[1,1]

1.8016086652342609

In [47]:
#Using a single column’s values to select data:
df[df["A"] >0]

                   A         B         C         D
2013-01-02  1.417273  1.801609  0.307748  1.341398
2013-01-04  0.885904 -0.652272 -0.116277 -1.303472
2013-01-05  1.133656  0.336882 -0.533011 -1.269728
2013-01-06  1.063304  1.038297 -0.864064  0.428878

In [48]:
df[df> 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.270176       NaN
2013-01-02  1.417273  1.801609  0.307748  1.341398
2013-01-03       NaN  0.775885  1.107011  0.750487
2013-01-04  0.885904       NaN       NaN       NaN
2013-01-05  1.133656  0.336882       NaN       NaN
2013-01-06  1.063304  1.038297       NaN  0.428878

In [49]:
df2= df.copy()

In [51]:
df2["E"] = ["one", "two", "three" ,"four" ,"five", "six"]

In [52]:
df2["E"].isin(["two", "four"])

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [53]:
#ins_08

NameError: name 'Path' is not defined